/*4.	Створити бібліотеку для роботи з точками та відрізками на площині. Типи точки та відрізку представити у вигляді записів:
тип Точка = запис
x, у: дійсн;
кз;
Відрізок = запис
a, b: Точка;
кз;
Реалізувати дії над точками:
1)	взяти точку t;
2)	покласти точку t рівною (x, у);
3)	показати точку t.
Реалізувати дії над відрізками:
1)	взяти відрізок s;
2)	показати відрізок s;
3)	покласти відрізок s рівним a, b;
4)	довжина відрізку s;
5)	чи лежить точка tна одній прямій з відрізком s;
6)	чи лежить точка tвсередині відрізку s;
7)	площа трикутника, утвореного точкою tта відрізком s.
У файлі записано послідовність точок. З використанням модуля роботи з точками та відрізками на площині знайти:
а)	трикутник з найбільшою площею, утворений точками послідовності;
б)	коло найменшого радіуса, всередині якого лежать всі точки послідовності;
в)	відрізок, на якому лежить найбільша кількість точок послідовності;
г)	коло, на якому лежить найбільша кількість точок послідовності.
*/
#pragma once
struct Point
{
	double x,y;
};
struct Line
{
	Point a, b;
};

typedef void (*PPut)(const double& x, const double& y, Point& p);
typedef	void (*PShow)(const Point& p);
typedef void (*LPut)(const Point& a, const Point& b, Line& p);
typedef void (*LShow)(const Line& l); 
typedef double (*LLen)(const Line& l);	
typedef int (*PPL)(const Line& l, const Point& p);
typedef double (*Area)(const Line& l, const Point& p);
